W5D4/URLShortener/app/models/shortened_url.rb

INSERT INTO "shortened_urls" ("long_url", "created_at", "updated_at", "user_id", "short_url") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "www.facebook.com"], ["created_at", "2020-06-11 21:21:17.293491"], ["updated_at", "2020-06-11 21:21:17.293491"], ["user_id", 1], ["short_url", "_Fb_KHoqHUlP4W4wz8iCAg"]]
---
  def self.create(user, long_url)
    ShortenedUrl.create!( {user_iUd:user.id, long_url: long_url, short_url:ShortenedUrl.random_code} )