W6D3/art_share/app/controllers/artworks_controller.rb

    def index
        if params.has_key?(:user_id)
            @artwork = Artwork.where(artist_id: params[:user_id])
        else
            @artwork = Artwork.all
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 8]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def update
        @artwork = Artwork.find(params[:id])
        if @artwork
            @artwork.update!(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "artworks" SET "image_url" = $1 WHERE "artworks"."id" = $2  [["image_url", "starry_night.com"], ["id", 6]]