W6D3/art_share/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."commenter_id" = $1  [["commenter_id", 8]]
---
    def index
        if params.has_key?(:user_id)
            @comments = Comment.where(commenter_id: params[:user_id])
        else
            @comments = Comment.all