W6D3/art_share/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "Alvin"]]
---
    def index
        if params.has_key?(:username)
            @users = User.where(username: params[:username])
        else
            @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1 WHERE "users"."id" = $2  [["username", "Alvin"], ["id", 3]]
---
    def update

        @user = User.find(params[:id])

        if @user
            @user.update!(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
    def destroy
        user = User.find(params[:id])
        user.delete